v13/burningCylinder/burningCylinder2D/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("surfacemesh.stl");

// Mark edges whose adjacent surface normals are at an angle less
// than includedAngle as features
// - 0  : selects no edges
// - 180: selects all edges
includedAngle   150;

subsetFeatures
{
// Keep nonManifold edges (edges with >2 connected faces)
nonManifoldEdges       yes;

// Keep open edges (edges with 1 connected face)
openEdges       yes;
}

// Write features to obj format for postprocessing
writeObj                yes;

// ************************************************************************* //
